StoveOpt/static_foamfiles/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    top_fuel
    {
        type            fixedValue;
        value           uniform 293;
    }
	L_fuel
    {
        type            fixedValue;
        value           uniform 293;
    }
	R_fuel
    {
        type            fixedValue;
        value           uniform 293;
    }
	bottom_fuel
    {
        type            fixedValue;
        value           uniform 293;
    }
    primary_inlets
    {
        type            fixedValue;
        value           uniform 293;
    }
    outlet_LHS
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
	outlet_RHS
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
	secondary_air_RHS
    {
		type            fixedValue;
        value           uniform 293;
    }
    secondary_air_LHS
    {
        type            fixedValue;
        value           uniform 293;
    }
	stove_body //This will probably need to change
	{
		type			fixedValue; 
		value			uniform 293; 
	
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
